In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("employee_data.csv")

In [3]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [4]:
df.sort_values("Salary")

   ID     Name  Age Department  Salary
7   8   Hannah   26  Marketing   47000
2   3  Charlie   28    Finance   48000
5   6    Frank   29    Finance   50000
0   1    Alice   25         HR   55000
9  10    Julia   30    Finance   60000
4   5      Eva   38         IT   65000
1   2      Bob   32         IT   72000
8   9      Ian   35         IT   75000
6   7    Grace   41         HR   82000
3   4    David   45  Marketing   91000

In [6]:
# for descending
df.sort_values("Salary",ascending=False)

   ID     Name  Age Department  Salary
3   4    David   45  Marketing   91000
6   7    Grace   41         HR   82000
8   9      Ian   35         IT   75000
1   2      Bob   32         IT   72000
4   5      Eva   38         IT   65000
9  10    Julia   30    Finance   60000
0   1    Alice   25         HR   55000
5   6    Frank   29    Finance   50000
2   3  Charlie   28    Finance   48000
7   8   Hannah   26  Marketing   47000

In [9]:
# sorting on multiple columns in desc
df.sort_values(["Salary","Age"],ascending=False)

   ID     Name  Age Department  Salary
3   4    David   45  Marketing   91000
6   7    Grace   41         HR   82000
8   9      Ian   35         IT   75000
1   2      Bob   32         IT   72000
4   5      Eva   38         IT   65000
9  10    Julia   30    Finance   60000
0   1    Alice   25         HR   55000
5   6    Frank   29    Finance   50000
2   3  Charlie   28    Finance   48000
7   8   Hannah   26  Marketing   47000

In [11]:
sorted_df=df.sort_values("Salary")
sorted_df

In [20]:
# now sort indexes 
sorted_df=sorted_df.sort_index()
sorted_df

   level_0  index  ID     Name  Age Department  Salary
0        0      0   1    Alice   25         HR   55000
1        1      1   2      Bob   32         IT   72000
2        2      2   3  Charlie   28    Finance   48000
3        3      3   4    David   45  Marketing   91000
4        4      4   5      Eva   38         IT   65000
5        5      5   6    Frank   29    Finance   50000
6        6      6   7    Grace   41         HR   82000
7        7      7   8   Hannah   26  Marketing   47000
8        8      8   9      Ian   35         IT   75000
9        9      9  10    Julia   30    Finance   60000

In [22]:
sorted_df=df.sort_values("Salary")
#now reset indexes with drop it will preserve old indexes as well
sorted_df=sorted_df.reset_index(drop=True)
sorted_df

   ID     Name  Age Department  Salary
0   8   Hannah   26  Marketing   47000
1   3  Charlie   28    Finance   48000
2   6    Frank   29    Finance   50000
3   1    Alice   25         HR   55000
4  10    Julia   30    Finance   60000
5   5      Eva   38         IT   65000
6   2      Bob   32         IT   72000
7   9      Ian   35         IT   75000
8   7    Grace   41         HR   82000
9   4    David   45  Marketing   91000

In [24]:
df["Ranking"]=df["Salary"].rank()
df

   ID     Name  Age Department  Salary  Ranking
0   1    Alice   25         HR   55000      4.0
1   2      Bob   32         IT   72000      7.0
2   3  Charlie   28    Finance   48000      2.0
3   4    David   45  Marketing   91000     10.0
4   5      Eva   38         IT   65000      6.0
5   6    Frank   29    Finance   50000      3.0
6   7    Grace   41         HR   82000      9.0
7   8   Hannah   26  Marketing   47000      1.0
8   9      Ian   35         IT   75000      8.0
9  10    Julia   30    Finance   60000      5.0

In [25]:
df["Ranking"]=df["Salary"].rank()
df

   ID     Name  Age Department  Salary  Ranking
0   1    Alice   25         HR   55000      4.0
1   2      Bob   32         IT   72000      7.0
2   3  Charlie   28    Finance   48000      2.0
3   4    David   45  Marketing   91000     10.0
4   5      Eva   38         IT   65000      6.0
5   6    Frank   29    Finance   50000      3.0
6   7    Grace   41         HR   82000      9.0
7   8   Hannah   26  Marketing   47000      1.0
8   9      Ian   35         IT   75000      8.0
9  10    Julia   30    Finance   60000      5.0

In [31]:
column_order=[col for col in df.columns if col!="ID"]
column_order+=["ID"]
column_order

['Name', 'Age', 'Department', 'Salary', 'Ranking', 'ID']

In [32]:
df[column_order]

      Name  Age Department  Salary  Ranking  ID
0    Alice   25         HR   55000      4.0   1
1      Bob   32         IT   72000      7.0   2
2  Charlie   28    Finance   48000      2.0   3
3    David   45  Marketing   91000     10.0   4
4      Eva   38         IT   65000      6.0   5
5    Frank   29    Finance   50000      3.0   6
6    Grace   41         HR   82000      9.0   7
7   Hannah   26  Marketing   47000      1.0   8
8      Ian   35         IT   75000      8.0   9
9    Julia   30    Finance   60000      5.0  10

In [33]:
print(df.to_string(index=False))

 ID    Name  Age Department  Salary  Ranking
  1   Alice   25         HR   55000      4.0
  2     Bob   32         IT   72000      7.0
  3 Charlie   28    Finance   48000      2.0
  4   David   45  Marketing   91000     10.0
  5     Eva   38         IT   65000      6.0
  6   Frank   29    Finance   50000      3.0
  7   Grace   41         HR   82000      9.0
  8  Hannah   26  Marketing   47000      1.0
  9     Ian   35         IT   75000      8.0
 10   Julia   30    Finance   60000      5.0